Revit 2024 API
BuiltInFailures.SketchFailures.PathReinforcementClosedLoop Property
 Sketch contains a closed loop. Can't create Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PathReinforcementClosedLoop { get; }
Visual Basic
Public Shared ReadOnly Property PathReinforcementClosedLoop As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PathReinforcementClosedLoop {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace